.svn/pristine/00/00fcf05707cc06ea9f576312d8ea24fb307daaff.svn-base

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl" xmlns:ns2="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl/types/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:issuePolicy>
            <pUserId>___insurer_integration_service_user___</pUserId><!--UserName doubt-->
            <pPassword>___insurer_integration_service_password___</pPassword><!--Password doubt-->
            <pTransactionId>___insurer_customer_identifier___</pTransactionId><!--127881868 doubt-->
            <pRcptList_inout />
            <pCustDetails_inout>
                <ns2:telephone1 />
                <ns2:dateOfBirth>___birth_date___</ns2:dateOfBirth><!--01-JAN-1980-->
                <ns2:telephone2 />
                <ns2:status1 xsi:nil="true" />
                <ns2:institutionName>___company_name___</ns2:institutionName>
                <ns2:profession>___occupation___</ns2:profession>
                <ns2:existingYn xsi:nil="true" />
                <ns2:addLine3>___communication_city___</ns2:addLine3><!--Mumbai-->
                <ns2:surname>___last_name___</ns2:surname>
                <ns2:addLine2>___communication_address_2___</ns2:addLine2>
                <ns2:partId xsi:nil="true" />
                <ns2:addLine1>___communication_address_1___</ns2:addLine1>
                <ns2:password xsi:nil="true" />
                <ns2:title>___salutation___</ns2:title>
                <ns2:delivaryOption xsi:nil="true" />
                <ns2:firstName>___first_name___</ns2:firstName>
                <ns2:middleName>___middle_name___</ns2:middleName>
                <ns2:mobileAlerts xsi:nil="true" />
                <ns2:loggedIn xsi:nil="true" />
                <ns2:partTempId xsi:nil="true" />
                <ns2:availableTime xsi:nil="true" />
                <ns2:pincode>___communication_pincode___</ns2:pincode>
                <ns2:polAddLine1>___communication_address_1___</ns2:polAddLine1>
                <ns2:polAddLine3>___communication_city___</ns2:polAddLine3>
                <ns2:polAddLine2>___communication_address_2___,___communication_address_3___</ns2:polAddLine2>
                <ns2:addLine5>___communication_state___</ns2:addLine5><!--Maharashtra-->
                <ns2:polAddLine5>___communication_state___</ns2:polAddLine5><!--MAHARASHTRA-->
                <ns2:polPincode>___communication_pincode___</ns2:polPincode>
                <ns2:cpType>___vehicle_registration_type___</ns2:cpType>
                <ns2:email>___email___</ns2:email>
                <ns2:status3 xsi:nil="true" />
                <ns2:status2 xsi:nil="true" />
                <ns2:emailAlerts xsi:nil="true" />
                <ns2:mobile>___mobile___</ns2:mobile>
            </pCustDetails_inout>
            <pWeoMotPolicyIn_inout>
                <ns2:vehicleTypeCode>___product_id___</ns2:vehicleTypeCode><!--22-->
                <ns2:vehicleSubtype>___dbmaster_insurer_vehicle_variant_name___</ns2:vehicleSubtype><!--1.2 E MANUAL TRANSMISSION-->
                <ns2:elecAccTotal>___electrical_accessory___</ns2:elecAccTotal>
                <ns2:addLoadingOn />
                <ns2:nonElecAccTotal>___non_electrical_accessory___</ns2:nonElecAccTotal>
                <ns2:polType>___vehicle_insurance_type___</ns2:polType>
                <ns2:registrationNo>___registration_no___</ns2:registrationNo><!--MH01AB1234-->
                <ns2:partnerType>___vehicle_registration_type___</ns2:partnerType>
                <ns2:ncb>___vehicle_ncb_next___</ns2:ncb><!--25-->
                <ns2:prvClaimStatus>___is_claim_exists___</ns2:prvClaimStatus><!--0-->
                <ns2:registrationDate>___vehicle_registration_date___</ns2:registrationDate><!--03-SEP-2015-->
                <ns2:miscVehType>0</ns2:miscVehType>
                <ns2:fuel>___dbmaster_insurer_vehicle_fueltype___</ns2:fuel><!--P-->
                <ns2:chassisNo>___chassis_number___</ns2:chassisNo>
                <ns2:contractId>0</ns2:contractId>
                <ns2:yearManf>___vehicle_manf_year___</ns2:yearManf><!--2015-->
                <ns2:spDiscRate />
                <ns2:cubicCapacity>___dbmaster_insurer_vehicle_cubiccapacity___</ns2:cubicCapacity><!--1198-->
                <ns2:regiLocOther>___dbmaster_insurer_rto_city_name___</ns2:regiLocOther>
                <ns2:addLoading />
                <ns2:vehicleSubtypeCode>___dbmaster_insurer_vehicle_variant_code___</ns2:vehicleSubtypeCode><!--3-->
                <ns2:prvPolicyRef>___previous_policy_number___</ns2:prvPolicyRef>
                <ns2:vehicleMake>___dbmaster_insurer_vehicle_make_name___</ns2:vehicleMake><!--HONDA-->
                <ns2:autoMembership />
                <ns2:termStartDate>___policy_start_date___</ns2:termStartDate><!--22-SEP-2017-->
                <ns2:carryingCapacity>___dbmaster_insurer_vehicle_seatingcapacity___</ns2:carryingCapacity><!--5-->
                <ns2:termEndDate>___policy_end_date___</ns2:termEndDate><!--21-SEP-2018-->
                <ns2:hypo>___financial_institute_name___</ns2:hypo>
                <ns2:branchCode>___insurer_integration_location_code___</ns2:branchCode><!--9906 branch of issue of policy doubt-->
                <ns2:prvNcb>___vehicle_ncb_current___</ns2:prvNcb><!--20-->
                <ns2:vehicleMakeCode>___dbmaster_insurer_vehicle_make_code___</ns2:vehicleMakeCode><!--107-->
                <ns2:vehicleIdv>___vehicle_expected_idv___</ns2:vehicleIdv><!--284699-->
                <ns2:prvInsCompany>___dbmaster_previousinsurer_code___</ns2:prvInsCompany><!--8-->
                <ns2:engineNo>___engine_number___</ns2:engineNo>
                <ns2:product4digitCode>___vehicle_insurance_subtype_2___</ns2:product4digitCode><!--1801-->
                <ns2:color />
                <ns2:vehicleModel>___dbmaster_insurer_vehicle_model_name___</ns2:vehicleModel><!--BRIO-->
                <ns2:vehicleType>___product_id_3___</ns2:vehicleType><!--Private Car-->
                <ns2:prvExpiryDate>___policy_expiry_date___</ns2:prvExpiryDate><!--21-SEP-2017-->
                <ns2:tpFinType>1</ns2:tpFinType><!--doubt-->
                <ns2:deptCode>18</ns2:deptCode>
                <ns2:vehicleModelCode>___dbmaster_insurer_vehicle_model_code___</ns2:vehicleModelCode><!--39-->
                <ns2:registrationLocation>___dbmaster_insurer_rto_city_name___</ns2:registrationLocation>
                <ns2:zone>___dbmaster_insurer_rto_zone_code___</ns2:zone>
            </pWeoMotPolicyIn_inout>
            <accessoriesList />
            <paddoncoverList>
                <ns2:WeoMotGenParamUser />
                <ns2:WeoMotGenParamUser />
                <ns2:WeoMotGenParamUser />
                <ns2:WeoMotGenParamUser />
                <ns2:WeoMotGenParamUser />
                <ns2:WeoMotGenParamUser />
            </paddoncoverList>
            <motExtraCover_inout>
                <ns2:sideCarValue xsi:nil="true" />
                <ns2:covernoteNo xsi:nil="true" />
                <ns2:noOfTrailers xsi:nil="true" />
                <ns2:subImdcode xsi:nil="true" />
                <ns2:covernoteDate xsi:nil="true" />
                <ns2:cngValue>___external_bifuel_value___</ns2:cngValue>
                <ns2:fibreGlassValue xsi:nil="true" />
                <ns2:voluntaryExcess>___voluntary_deductible___</ns2:voluntaryExcess>
                <ns2:totalTrailerValue xsi:nil="true" />
                <ns2:extraField1 xsi:nil="true" />
                <ns2:sumInsuredTotalNamedPa>___pa_named_passenger_si___</ns2:sumInsuredTotalNamedPa>
                <ns2:geogExtn xsi:nil="true" />
                <ns2:noOfPersonsLlo>___is_llpd_2___</ns2:noOfPersonsLlo>
                <ns2:noOfEmployeesLle xsi:nil="true" />
                <ns2:extraField2 xsi:nil="true" />
                <ns2:extraField3 xsi:nil="true" />
                <ns2:sumInsuredPa>___pa_unnamed_passenger_si___</ns2:sumInsuredPa>
                <ns2:noOfPersonsPa>___dbmaster_insurer_vehicle_seatingcapacity___</ns2:noOfPersonsPa>
            </motExtraCover_inout>
            <premiumDetails />
            <premiumSummeryList />
            <pQuestList />
            <ppolicyref_out />
            <ppolicyissuedate_out />
            <ppartId_out />
            <pError_out />
            <pErrorCode_out />
            <ppremiumpayerid />
            <paymentmode>CC</paymentmode><!--CC-->
            <potherdetails>
                <ns2:covernoteNo xsi:nil="true" />
                <ns2:cceCode xsi:nil="true" />
                <ns2:extra1>NEWPG</ns2:extra1>
                <ns2:extra2 xsi:nil="true" />
                <ns2:imdcode>56530001</ns2:imdcode>
                <ns2:extra3 xsi:nil="true" />
                <ns2:extra4 xsi:nil="true" />
                <ns2:extra5 xsi:nil="true" />
                <ns2:leadNo xsi:nil="true" />
                <ns2:runnerCode xsi:nil="true" />
            </potherdetails>
            <pMotDetariff>
                <ns2:driverQualificationCode xsi:nil="true" />
                <ns2:vehPurchaseType xsi:nil="true" />
                <ns2:extCol25 xsi:nil="true" />
                <ns2:extCol26 xsi:nil="true" />
                <ns2:tacMakeCode xsi:nil="true" />
                <ns2:extCol23 xsi:nil="true" />
                <ns2:extCol24>___policy_tenure___</ns2:extCol24>
                <ns2:extCol29 xsi:nil="true" />
                <ns2:extCol27 xsi:nil="true" />
                <ns2:extCol28 xsi:nil="true" />
                <ns2:extCol33 xsi:nil="true" />
                <ns2:extCol32 xsi:nil="true" />
                <ns2:extCol31 xsi:nil="true" />
                <ns2:extCol30 xsi:nil="true" />
                <ns2:registrationAuth xsi:nil="true" />
                <ns2:extCol12 xsi:nil="true" />
                <ns2:extCol13 xsi:nil="true" />
                <ns2:extCol14 xsi:nil="true" />
                <ns2:extCol15 xsi:nil="true" />
                <ns2:extCol16 xsi:nil="true" />
                <ns2:extCol17 xsi:nil="true" />
                <ns2:extCol18 xsi:nil="true" />
                <ns2:extCol19 xsi:nil="true" />
                <ns2:otherGoodsFrequency xsi:nil="true" />
                <ns2:extCol20>___thankyouurl___</ns2:extCol20>
                <ns2:extCol22 xsi:nil="true" />
                <ns2:incurredClmExpCode xsi:nil="true" />
                <ns2:extCol21 xsi:nil="true" />
                <ns2:clmHistCode xsi:nil="true" />
                <ns2:roadType xsi:nil="true" />
                <ns2:bodyType xsi:nil="true" />
                <ns2:monthOfMfg xsi:nil="true" />
                <ns2:natureOfGoods xsi:nil="true" />
                <ns2:extCol9 xsi:nil="true" />
                <ns2:extCol8 xsi:nil="true" />
                <ns2:extCol7 xsi:nil="true" />
                <ns2:extCol6 xsi:nil="true" />
                <ns2:vehPurchaseDate xsi:nil="true" />
                <ns2:extCol5 xsi:nil="true" />
                <ns2:extCol4 xsi:nil="true" />
                <ns2:vehDrivenBy xsi:nil="true" />
                <ns2:extCol3 xsi:nil="true" />
                <ns2:extCol2 xsi:nil="true" />
                <ns2:extCol1 xsi:nil="true" />
                <ns2:goodsTransType xsi:nil="true" />
                <ns2:permitType xsi:nil="true" />
                <ns2:extCol38>~___nominee_name___~___nominee_relation___</ns2:extCol38>
                <ns2:extCol39 xsi:nil="true" />
                <ns2:extCol34 xsi:nil="true" />
                <ns2:extCol35 xsi:nil="true" />
                <ns2:extCol36>___tp_policy_details___</ns2:extCol36>
                <ns2:extCol10>___addon_package_name___</ns2:extCol10>
                <ns2:extCol37 xsi:nil="true" />
                <ns2:extCol11 xsi:nil="true" />
                <!--POS_CONFIG_START-->
                <ns2:extCol40>___posp_pan_no___</ns2:extCol40>
		<!--POS_CONFIG_FINISH-->
                <ns2:driverExperience xsi:nil="true" />
            </pMotDetariff>
        </ns1:issuePolicy>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>